[
{"title": "Don’t Miss Retro Gamer Issue 182", "text": ["Retro Gamer issue 182 has hit the shelves today, and if you’re a fan of the Mega Drive you won’t want to miss it. Our cover feature takes a deep dive into the technology that makes the 30 year old console tick, with key developers including Mark Cerny, Trip Hawkins and Rieko Kodama giving their expert insight. What’s more, we have two added gifts – a fantastic sticker sheet featuring classic Sega sprites and iconography, and a guide to the Mega Drive’s essential games. If all that gets you in the mood for to revisit some 16-bit hits, we’ve also reviewed the new Sega Mega Drive Classics collection.", "There’s plenty more inside, too. We have features on the creation of Savage, Rock ‘N’ Roll Racing and EyeToy: Play, an Ultimate Guide to Konami’s arcade racer WEC Le Mans, and a Minority Report focusing on the Atari 8-bit range. Outside of specific games, we’ve got a collector’s guide to Eighties publisher Software Projects, a look back at Brian Howarth’s Digital Fantasia, and an examination of games made using the Build engine. Our sit-down interview for the month is with Matt Gray, the musician behind games such as Last Ninja 2 and Driller. And of course we’ve got all the usual favourites including Retro Revivals, Hardware Heaven and The Unconverted.", "You can buy the issue now from all good newsagents for £5.99, or ", ". Alternatively, if you spotted the exclusive subscriber cover up there and don’t want to miss them in future, you can ", " too.", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "ToeJam & Earl: Back In The Groove Set For Autumn", "text": ["If you’re looking forward to ", ", you’re definitely a patient sort. The Kickstarter campaign for the game finished all the way back in March 2015, raising over half a million dollars. Since then the game has changed in scope and moved to consoles as well as the original PC version, and picked up Adult Swim Games as a publisher. However, development finally appears to be coming to an end, as HumaNature Studios is talking about a potential release date.", "The latest update on the game targets it as an autumn release. “", "” said Greg Johnson, studio founder.", "One big surprise is a change to the game’s publishing arrangements, with Adult Swim Games no longer involved in the project. “", "” explained Johnson. The split seems to have been amicable though, as he continues “", "”", "For console owners and backers looking forward to playing sooner, there’s also good news in the update. “", "” according to Johnson.", "Are you still looking forward to the return of ToeJam & Earl, or has your excitement dampened over the last few years? Let us know on the forums or via our social media pages.", "Tags: ", ", "]},
{"title": "Pre-order the Arcade 1Up (advertorial)", "text": ["What makes a videogame feel great? Is it the game itself, the friends you enjoy it playing with, or the machine powering the amazing experience that you’re completely engrossed in?", "For most of us, the answer is all three. And if you happened to chance upon a bustling amusement arcade during your youth then you’ll fully understand why.", "Games played on a classic arcade cabinet seemed to come alive. They’d pull you in with graphics that would pop from the screen and provide robust, chunky controls that perfectly complemented the game.", "Above all else, though, they would entice you with audio that would not only scream to be heard over the sounds from other games but compete with the chatter and laughter filling the room.", "That’s because arcades were a destination, a place for you to hang out with your pals and have fun. And if you want to replicate that enjoyment, then how better than a modern arcade cabinet packed with the greatest of hits?", "Step forward the Arcade1UP cabinets, a range of amazing machines that bring the arcade home with no quarters or tokens required.", "They allow your favorite games from yesteryear to come back to life in the way that they should always be played – with arcade-style joysticks, trackballs and buttons.", "At a wallet-friendly introductory rate of $299 they really are a bargain. But if you want to guarantee one, then you’ll need to be quick.", "GameStop, which is the only retailer allowing pre-orders in store, expects them to sell as fast as your reactions will need to be to master these games. You can, however, also order at gamestop.com.", "But why are they set to be popular? Well, the cabinets will inevitably light up your room thanks to a 17-inch LCD screen that will perfectly showcase the games in their original form, with the same graphics and sounds that made them instantly appealing the first time around.", "The machines will also turn heads for their sheer presence since each upright cabinet stands at three-fourths the size of the original machine.", "Most crucially, however, are the classic games you’ll be able to enjoy.", "GameStop will have a finger-twitching four cabinets in total and each one contains up to four games.", "But just as important as the selection of games, is the look of the cabinets, each of which are faithfully decorated with the eye-catching marquee and side artwork of the leading title.", "This was no mean feat for Arcade1UP which went to great lengths to find the original art sheets in order to recreate them, helping those memories to come flooding back.", "To add to the fun, the cabinets need to be self-assembled so you get a chance to go behind the scenes of the machines and get up close with each of the parts inside and out. This is a very simple process and it has enabled the makers to keep the cost of these impressive cabinets down.", "Don’t forget, you need to get your pre-order in to guarantee one or more of the cabinets, though. Ask the staff at your local GameStop for more information or head over to "]},
{"title": "The Voice Of Movies Games And Videos Returns", "text": ["Are you a human being of a certain age, whose geographical location and status as a television viewer allowed you to watch Movies Games And Videos on ITV? If so: congratulations, you are old like us, and you evidently had a lot of free time on Saturday afternoons like us too. We remember it because the show had an odd habit of featuring Neo Geo games, and you didn’t often see those outside of an arcade.", "But also, you might remember Steve Priestley, the forever unseen narrator of that particular television programme. Well, thanks to Funtenga Video Software, he’s back doing the thing we all remember – narrating footage of game previews. But these are no ordinary games! Instead, you will see men fighting their trusty vessels and the wonders of Thanks Blaster. It really does defy reasonable explanation, so we’d advise you just click the play button and leave the problem of working it out to future you.", "Tags: ", ", ", ", "]},
{"title": "Retro Gamer Issue 192 Is On Shelves Now", "text": ["Issue 192 of Retro Gamer is available to buy now from all good newsagents and ", ", and we’ve teamed up with ", " to deliver a special package for our readers. Each copy of the magazine comes with a CD full of Rob Hubbard remixes – the best of the game music legend’s Commodore 64 work is represented here, with tunes from the likes of Monty On The Run, Commando, and Dragon’s Lair II remixed and reimagined by the likes of Matt Gray, Uncle And The Bacon and even Rob himself (see the full track listing below). Inside the magazine itself, you’ll also find an interview with Rob talking about Project Hubbard and ", ", due to take place on 15th June 2019.", "That’s not all though, as you’ll have noticed that our cover story is on Yoshi’s Island, one of the greatest 2D platform games ever made. Nintendo’s Takashi Tezuka and Shigefumi Hino reveal the development process behind the SNES classic, from the initial decision to avoid another Mario game to the game’s beautiful hand-drawn style, and of course the use of the SuperFX 2 enhancement chip.", "There’s plenty more to see elsewhere in the issue. Former Ocean Software artist Mark R Jones tells the story of his first month at the company in his own words, with unseen sketches and photographs from the time. Our regular Making Of features examine the cult C64 classic Space Taxi, Lucasarts’ eccentric management sim Afterlife, EA’s dangerous extreme sports title Skitchin’ and the PlayStation ninja classic Tenchu: Stealth Assassins. We also catch up with the Road Runner in an Ultimate Guide, and look back at the evolution of Head Over Heels with Jon Ritman and Bernie Drummond.", "That’s not all, either. Rebecca Heineman discusses her decades in the games industry in In The Chair, we take a look at the Amiga CD32 in our Minority Report, and Julian Gollop tells all about the history of his strategy studio Mythos Games. The long-awaited ToeJam & Earl: Back In The Groove is reviewed, and of course the magazine features the usual selection of Retro Revivals, news, columns and guides. And if all of this sounds like something you want to be a part of long-term, we’ve got a great offer of a ", ".", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "\nFrom ", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Yasuyuki Oda talks SNK Heroines", "text": ["SNK’s latest fighting game, SNK Heroines: Tag Team Frenzy is out this week for Nintendo Switch and PlayStation 4, bringing together a variety of fan favourite fighters from SNK’s past for a party-style battle. The game’s characters find themselves transported into a mysterious mansion by an unknown party – and judging by the costumes that the women now find themselves in, the kidnapper clearly has a variety of fetishes. The fighting roster includes Fatal Fury’s Mai Shiranui, Samurai Shodown’s Nakoruru, Shermie from the King Of Fighters series and even Terry Bogard, whose gender has been forcibly reassigned by the mysterious abductor.", "The emphasis is firmly on having fun rather than technical mastery – special move inputs are simplified as compared to the King Of Fighters series, items can be used ranging from time bombs to giant wrecking balls, and the game boasts a new Dream Finish system that ensures a spectacular end to every fight. There’s also a variety of costumes to unlock, and plenty of customisation to be done.", "SNK’s producer Yasuyuki Oda sat down with us to explain a bit more about the game:", "Soon after The King Of Fighters XIV was released, we decided to start with a new project with popular female characters from throughout the whole SNK library. That’s where this came from.", "Actually, it was kind of an opposite influence. Because we had already made a game like that, we wanted to make sure SNK Heroines wasn’t just a rehash of what that was, but a complete differentiation and a new game within that concept of using female fighters.", "There were three different categories – popular characters from SNK, characters that we want to make more popular, and what we call the “special box.”", "If you’ve played The King Of Fighters XIV, you might know that everyone gets revived at the end of the story. So it was kind of a way to bring back Shermie.", "The only way you can win is with a Dream Finish, so even if you get your opponent’s energy meter all the way down to zero, that opponent will not be defeated until you use a Dream Finish. The reason that this is important is because rather than a traditional fighting game where you’re using many combos or trying to chain things together, it’s for people who maybe are not particularly great at that. It’s more of a timing thing – waiting to build up your Dream Finish, and then waiting to get your enemy down to low energy, and then unleashing it at the right moment. Or maybe your playable character has used all of their stamina gauge, and so you switch out to your character in reserve who has the Dream Finish, and do it right then.", "Yes, the idea is to be as broad as possible with who is able to play this game. Of course there’s practice involved, you still have to practice and learn how to play the game well, but it’s very welcoming for everyone.", "Story mode, versus mode, survival mode, training mode, online mode – and there’s an option within the online mode to watch other players and bet points on their battles.", "Those are used for customisation – there’s lots of costumes, lots of accessories, you can buy different backgrounds and take screenshots using them. The in-game currency is the way to get all this stuff, the betting is just a quick way to get it so you can unlock more things that you’d like to use.", "There are three per character, and around 130 customisation items.", "Tags: ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Feeling Froggy? Hop Over To The Forum", "text": ["If you’re a fan of Frogger, you’re in good company. The original arcade game was a smash hit that attracted a broad spectrum of fans, and the amphibious hero had a hugely successful comeback run starting in the late Nineties – and that’s not to mention his cartoon appearances or the classic episode of Seinfeld dedicated to George’s pursuit of a high score. And now he’s the star of this week’s ", ", kindly provided by community team member AllenTheAlien. If you fancy a chat about one of the best non-violent games from the golden age of the arcades, ", ".", "Of course, the company that brought Frogger into being was Konami, and this month we’re celebrating the company’s 50th anniversary with a special issue. As well as the regular magazine (featuring a gorgeous full art Castlevania cover), readers get The Mini Konami Companion, a guide to 50 of the legendary developer’s greatest games, and a sticker sheet featuring sprites and artwork from across the company’s history. To pick up your copy, visit your local newsagent or ", ".", "Tags: ", ", ", ", ", ", "]},
{"title": "Discuss Missile Command’s Explosive Impact On Our Forum", "text": ["Many videogames have had plots involving a character having dreams of apocalyptic terrors, but few have been directly inspired by them. Yet that’s exactly what drove Atari’s Dave Theurer to create Missile Command, as the Cold War meant that the threat of nuclear destruction was an ever-present source of paranoia in Eighties America. Thankfully, Russian aggression is a thing of the past today (", ") and rogue states haven’t been able to create their own nuclear weapons (", "), so we don’t have to worry about the prospect of a mushroom cloud on the horizon any time soon.", "Thankfully the game itself was significantly more fun than radiation sickness, as you used a trackball to try to intercept missiles targeting six Californian cities. And if you enjoyed playing Missile Command in the arcade, or indeed an a home system, you might fancy discussing it in the Retro Gamer forum, where the game is our current Retro Spotlight. ", "Of course, if Missile Command isn’t your thing, there’s plenty more to do on the ", " – discuss other games, post high scores or even give feedback on the latest issue of the magazine. And if you haven’t picked up issue 195 yet, you can do that now – ", "Tags: ", ", ", ", ", ", ", ", "]},
{"title": "Jump Into The Forum For A Chat About Donkey Kong", "text": [", which is a fascinating game for all kinds of reasons. In the Eighties it was subject to all sorts of battles, as Universal unsuccessfully sued Nintendo over copyright infringement, while Atari and Coleco clashed over conversion rights. In the arcades the game has been the battlefield for vicious high score competitions, featuring stunning victories and astonishing allegations of cheating, and even inspired the documentary The King Of Kong. Donkey Kong himself went on to become a huge gaming star in his own right, appearing across a variety of platform games and a series of bongo-based music games for the GameCube. Oh, and then there’s the small matter of the little bloke you play as, some guy named Mario. We don’t quite know what happened to him later on. If you fancy chatting about the game, ", ".", "Incidentally, one of our favourite versions of Donkey Kong is the excellent Game Boy game, which starts off like the arcade game before becoming an astonishing original puzzle platformer. And issue 196 of Retro Gamer is out today, with Nintendo’s green-screened masterpiece on the front cover. Pick that up in all good newsagents, or ", ".", "Tags: ", ", ", ", ", ", ", ", "]},
{"title": "Retro Gamer 206 is on sale now", "text": ["The latest issue of Retro Gamer is on sale now, with a cover feature looking at the impact of Valve’s groundbreaking Half-Life series! Read about how these classic games evolved the first-person shooter with their immersive storytelling, innovative use of physics and support for mods that became huge games in their own right.", "Elsewhere in the issue, we speak to wrestling and gaming experts about the wrestling genre, and revisit the unique natural disaster themed action adventures of the Disaster Report series. While Formula 1 drivers are racing on F1 2019, we learn about the creation of Codemasters’ original Grand Prix Simulator. We’ve also got features on the evolution of Ant Attack and videogame stamps, an ultimate guide to SCI: Special Criminal Investigation, and much more besides.", "During the COVID-19 crisis, we cannot supply print issues of Retro Gamer to retailers, but single issues are still available to buy via ", ". UK subscriptions will continue as normal, so if you want to make sure you don’t miss an issue, it’s worth taking the time to set one up – especially as we’re currently ", ", a huge saving over the cover price.", "For international customers, existing subscribers will have their print issues held to be mailed at a later time, with digital copies provided in the interim. Single issues can be ordered for international postage, but new non-UK subscriptions can’t be taken out until we’re able to resume normal service.", "Until next time, stay safe, stay at home, and take your mind off the world’s troubles with some games from times gone by.", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "We’ve Got Space To Chat About Lunar Lander", "text": [", Atari’s devilishly difficult arcade game from the Seventies. Inspired by the space race that saw the USA put a man on the moon in 1969, the game tasked players with balancing thrust, gravity and momentum to safely land a spaceship on the hazardous lunar surface. Failure to come in at the correct speed or angle would result in the destruction of the craft.", "While Lunar Lander wasn’t a failure by any stretch of the imagination, and was noteworthy as the first Atari arcade game to use vector graphics, its popularity was eclipsed by that of Atari’s other vector space-based game, Asteroids. Despite that, it went on to inspire a whole range of similar games and named its own subgenre.", "If you fancy chatting with other like-minded retro gamers about this, ", ".", "Tags: ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Retro Gamer 224 is on sale now!", "text": ["The latest issue of Retro Gamer is hitting shelves today, and we’re celebrating the 25 year old Nintendo 64 by taking a deep look at the hardware. To find out how the machine ticked at a technical level, we speak to developers who worked on great games including Super Mario 64, Banjo-Kazooie, 1080 Snowboarding, Diddy Kong Racing, Excitebike 64 and Star Wars Episode I: Racer.", "Of course, that’s not all. Elsewhere in the issue we have a tribute to Falcom, the celebrated Japanese RPG developer that has just reached its 40th anniversary, as well as features on the creation of the PS2’s graphical marvel Ghosthunter, the surprisingly tough The Simpsons: Bart vs The Space Mutants and the CD-ROM showcase Litil Divil. You’ll also find an Ultimate Guide to Technos’ beat-’em-up sequel Double Dragon II: The Revenge, covering the arcade game with a look at all of the home conversions, plus a feature on the evolution of the ever-popular egg Dizzy. A guide to collecting games for SNK’s magnificent Neo Geo Pocket Color also awaits, as does our regular long interview – this time with videogame music veteran Matt Furniss.", "You can pick up issue 224 of Retro Gamer in all good newsagents, or buy ", " and ", " from Magazines Direct.", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Round-Up: Retro Gaming At CES 2018", "text": ["While the Consumer Electronics Show is typically the place for tech companies to show off the gadgets of the future, retro gaming brands have embraced the show as a place to showcase their own upcoming products. To that end, Retro-Bit, Hyperkin and My Arcade have new products on display that are sure to appeal to the nostalgic gamer.", "Retro-Bit has the most new products on show, continuing its multifaceted approach to the retro market. The ones which have generated the most buzz are the new officially licensed Sega accessories, covering the Mega Drive, Saturn and Dreamcast. All three consoles will be receiving three types of new controllers: standard versions for use on original hardware, USB versions for use on computers, and wireless Bluetooth versions which can be used with Bluetooth-compatible hardware or (with a receiver dongle) the original hardware. Mega Drive pads are exclusively the six-button versions, Saturn controllers use the Japanese designs and were shown in a variety of colour configurations, and the Dreamcast pads were shown in white and black versions.", " Bluetooth Arcade Pad and Reciever for the win 😍 ", " ", "— Retro-Bit (@RetroBitGaming) ", "Additionally, all three consoles will be getting officially licensed power cables, composite AV and S-Video cables. A controller extension cable was shown for the Saturn, and a VGA box was revealed for the Dreamcast. Prices and release dates have yet to be announced for any of the Sega items.", "The next two cartridge releases from Retro-Bit have also been revealed: Holy Diver (NES) and R-Type Returns (SNES). Holy Diver is a popular Castlevania-style platform adventure which had previously only been released in Japan, meaning that it will be released in NES cartridge form for the first time. R-Type Returns combines Super R-Type and R-Type III: The Third Lightning on one cartridge, and should be fantastic value given the price of the latter game. Both games will be available for pre-order later this month, and join Retro-Bit’s existing range of NES and SNES releases including the Data East All-Star Collection and the Jaleco Brawler’s Pack.", "R-Type Returns Collectors Edition ", " ", "— Retro-Bit (@RetroBitGaming) ", "A new handheld all-in-one console is also coming from Retro-Bit, the Go Retro! Portable. The Game Boy-style unit uses the casing from the abandoned Super Retro Boy project, and features games from Capcom including Mega Man, Commando and 1943. The packaging boasts of over 300 games and a rechargeable battery with ten hours of life per charge, and the machine is expected in September of this year. Also on display were existing products including the Super Retro-Cade plug and play console (reviewed in Retro Gamer issue 177), the Super Retro Trio+ and the Retro Entertainment System+.", " – a prototype device that Hyperkin will doubtless have to rename prior to launch. This machine accepts original Game Boy cartridges (with the possibility of also running Game Boy Color carts), and promises a number of features to enhance your Game Boy experience. These include a backlight with customisable colours, durable aluminium casing and an internal battery which charges via USB-C. The device is slated for release in the summer at a sub-$100 price point. Hyperkin also launched the SupaRetroN HD this week, a SNES-compatible console with HDMI output and original cartridge support for $69.99.", "CES 2018: Game Boy Is Coming Back Thanks to Hyperkin ", " ", "— Gizmodo UK (@GizmodoUK) ", "My Arcade has recently been making waves with functional miniature arcade cabinets featuring iconic Data East games such as Burger Time and Karate Champ, and at CES it revealed that we’ll be seeing Namco games joining the range this year. Amongst the games on display were Pac-Man, Dig Dug, Galaxian, Mappy and Rolling Thunder, each standing just six inches tall and featuring authentic cabinet art. The existing models retail for $29.99, and we’d expect to see something similar for the new games.", "What are you most excited about from CES? Let us know on the forum, on social media or by writing in to our Mailbag section.", "Check out our new BANDAI NAMCO licensed Micro Players! ", " ", " ", "— MyArcade (@MyArcadeRetro) ", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Retro-Bit Multi-Carts On Sale This Weekend", "text": ["Tags: ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Retro Gamer Sponsors Retro Area At PC Gamer Weekender 2018", "text": ["Our chums over at PC Gamer are throwing a big old bash on 17-18 February at London Olympia, called the ", ". You’ve probably guessed that it will showcase the latest in computer gaming and technology, but did you know that ", "? We do – but of course, Retro Gamer is sponsoring it.", "The machines you’ll have a chance to get your hands on include the 8-bit and 16-bit micros you see in our magazine like the ZX Spectrum, Commodore 64 and Amiga 500, as well as a range of vintage PCs running games such as Theme Park, Half-Life and Dark Forces. For those of you with a competitive streak, equipment provider ", " is also bringing a good old-fashioned LAN setup, where you’ll have the chance to prove your superiority on Battlefield 1942 and Command & Conquer: Red Alert 2 (a game that very nearly wrecked our Nick’s exams).", "If you’re the type of modern PC gamer who ends up with an empty wallet whenever a Steam sale rolls around, there’s plenty for you to do too. As well as playing games and shopping for hardware, you’ll be able to meet the PC Gamer team, attend talks from developers, pick up valuable computer building and maintenance skills at hardware workshops, compete for glory in tournaments, and even take a break with some tabletop gaming.", "If all of that sounds enticing, make sure you’re at London Olympia on 17-18 February. Tickets start from just £12.99, and you can get an extra 20% off by using the code RETRO20 when booking. For more information, ", ", or ", ".", "Tags: ", ", ", ", ", ", "]},
{"title": "Snag The King Of Fighters 2002 For Free", "text": ["Here’s a deal not to be missed – ", " is offering PC owners a free copy of The King Of Fighters 2002, as long as you log in and claim it before the offer expires at 14:00 GMT on Thursday 15th February 2018. You only need to sign up for a GOG.com account to take advantage of this offer – the game is DRM-free and doesn’t require any additional software.", "If you don’t know what all the fuss is about, let us fill you in: The King Of Fighters is a crossover fighting game series, featuring characters from various SNK fighting games including the Fatal Fury and Art Of Fighting series, as well as brand new originals. The series has a long history of excellence and the 2002 entry is a fan favourite due to its status as a “Dream Match” game – meaning that it ignores the story and pulls in dead and otherwise retired characters. This was the penultimate Neo Geo game in the King Of Fighters series, and went back to the classic 3-on-3 battles of the past, dropping the Striker system from 1999 – 2001.", "Grab a copy now and let us know what you think of the game on social media or on our forums!", "Tags: ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Gears Of Games Presents Fairlight: An Interview", "text": ["Spectrum fans might well remember ", " and ", ", from Swedish coder Bo Jangeborg. These isometric adventure games were both highly regarded by fans of Sir Clive’s finest, with the original receiving a whopping 95% from Crash, and Computer & Video Games describing it as possessing “a level of detail and precision which surpasses anything seen on a Spectrum before.”", "YouTube channel ", " has recently tracked down Bo Jangeborg for a major interview, which you can see above. It’s well worth a look – the interview is conducted entirely in English and goes into a great deal of depth, with the video running for 54 minutes. The production values are high, and Bo does the vast majority of the talking, covering everything from his start in programming to the various technical tricks used in Fairlight. If you’re a fan of the games, this is essential viewing.", "Give it a watch and let us know what you thought via our forum or our social media pages!", "Tags: ", ", ", ", ", ", ", ", "]},
{"title": "Celebrate SNK’s 40th Anniversary With Retro Gamer 187", "text": [" ", "The latest issue of Retro Gamer is out on Thursday 1 November, and it’s a special celebration of SNK’s 40th anniversary. The magazine comes with a sticker sheet featuring sprites and artwork from the company’s history, as well as The Mini SNK Companion – a guide to 40 great games by SNK and on SNK hardware, featuring brand new developer interviews. In the main magazine, our cover feature looks back at the company’s life, death and rebirth with a selection of interviewees from the company’s past and present. We also have an interview on the development of the SNK 40th Anniversary Collection, due for release soon on Nintendo Switch.", "Of course, that’s not all we’ve got in the issue. In our regular Making Of features you can learn how the London gangster game The Getaway moved from PlayStation to PS2 during its development, find out how Gauntlet: The Third Encounter arrived on Atari Lynx and discover the tale behind Lucasarts’ classic adventure The Eidolon.", "Elsewhere you’ll find a feature on the Game Boy Color (celebrating its 20th anniversary this year), Ultimate Guides to the fantasy shoot-’em-up Gynoug and the over-the-top beat-’em-up NARC, a retrospective on the developer Atomic Planet and a Bluffer’s Guide to westerns. We also speak to DotEmu about Windjammers 2 and Streets Of Rage 4, get Darren Melbourne to reveal his Desert Island Disks and pay tribute to the late composer Ben Daglish.", "As always, you can pick up Retro Gamer from newsagents, digital magazine retailers and of course online via ", ".", "Tags: ", ", ", ", "]},
{"title": "Mr Biffo Launches Digitiser: The Show Kickstarter", "text": ["Regular readers of our fine magazine will be aware of our columnist Mr Biffo – a man more formally known as Paul Rose, the driving force behind the legendary Teletext games magazine Digitiser.", "Today, he’s launched ", ", a retro gaming YouTube show which promises to be “The sort of gaming show we’ve always wanted, but which broadcasters are too scared to make – and that YouTube isn’t offering.” Mr Biffo will be joined by co-hosts Gameplay Jenny, Larry Bundy Jr, Paul Gannon and Octavius Kitten, as well as guests including the likes of Kim Justice, Ashens, Danny Wallace and Violet Berlin.", "Digitiser: The Show is scheduled for six main episodes, a secret episode for backers a special episode in front of a live audience. The project blew through its £7,000 funding goal with great ease after launching this morning, and is currently over the £17,000 mark. Backer rewards start from £5 for an on-screen credit, moving to £15 for the secret episode and £30 for the chance to be in the live audience. At higher tiers you’ll find signed Wil Overton posters, a DVD and more. If you want to back it, you’ve got until Sunday 8 April to do so.", "For more information about Digitiser: The Show, including details on how to pledge, ", ".", "Tags: ", ", ", ", ", ", "]},
{"title": "Replay Events Announces Play Expo London", "text": ["UK fans of retro gaming will undoubtedly be familiar with Play Expo – the events, held by Replay Events around the UK, are a heady mixture of classic arcade, console and computer gaming, with modern games, pinball, shopping opportunities, special guests and more added for good measure. While the events are a popular destination for players, they’ve typically been located more conveniently for those in the north – only 2016’s Margate event stands out against Blackpool, Manchester and Glasgow.", "But that’s about to change, as ", " has been announced for 11-12 August 2018. The first Play Expo to be held in the capital will be at Printworks, a venue located in the Surrey Quays area of the Docklands. The show will offer up all the fun normally associated with Play Expo, but in a slightly more convenient location for those of us in the south. Adult day tickets are £20 and child day tickets £14, with discounts for family and full weekend bookings.", "To keep up with the latest news on Play Expo London, including guest announcements and more, ", ".", "Tags: ", ", ", ", ", ", "]},
{"title": "V-Rally Slides Back Into Racing Game Competition", "text": ["Racing game enthusiasts of a certain vintage will remember the V-Rally series, a trio of rather good rally games launched in the late Nineties and early Noughties on platforms including PlayStation, N64. Dreamcast, PS2, Xbox, GameCube, PC and Game Boy Advance. The last one was the reasonably received V-Rally 3 in 2002-2003, and the series subsequently disappeared without a trace amidst publisher problems.", "So, we’re surprised to tell you that V-Rally will return to the V-Road in 2018. V-Really? V-Right. The new game is being published by Bigben Interactive and developed by Kylotonn Racing Games. The latter company actually has a connection to the classic series too, as the game director Alain Jarniou was a programmer on V-Rally 3.", "So far, we know that V-Rally 4 will be available for PS4, Xbox One, Switch and PC in September 2018. It’ll have 50 cars and game modes including Rally, Extreme-Khana, V-Rally Cross, Buggy and Hill Climb, as well as Online and Career modes. Take a look at the trailer above for a first look at the game, and lets us know if you’re excited on the forum or via social media.", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Retro Gamer Issue 179 Hits The Shelves!", "text": ["Issue 179 of Retro Gamer is rolling into newsagents, with two fantastic gifts that will please any fan of the Commodore 64. The C64 Remix CD, produced in association with ", ", features 12 classic tunes reimagined from their original SID incarnations, with the likes of Matt Gray, Marcel Donné and Chris Abbott remixing Rob Hubbard, Martin Galway and more – see the bottom of this post for the full track list. There’s also a double-sided poster, featuring a nostalgic Commodore 64 scene on one side and a selection of fantastic artwork from the late Bob Wakelin on the other.", "Inside the magazine, you’ll find two great features on Pac-Man. In the first, Tod Frye talks about his Atari 2600 conversion of the classic arcade game, and the highs and lows that came with it. In the second, we delve into the late-Eighties arcade sequel Pac-Mania and all of its home conversions in an Ultimate Guide. Elsewhere in the magazine, you’ll find the making of home computer hits Dark Star and Moonstone as well as the hit Disney licensed platformer Aladdin. Additionally, there’s a collector’s guide to Quicksilva games, a look at the BBC Micro’s excellent arcade clones and a Minority Report on import Dreamcast games.", "You’ll also find an Ultimate Guide to Konami’s lighthearted shoot-’em-up Parodius, a history of Sonic The Hedgehog’s outings on the Master System. As always the issue is capped off with a sit-down interview, with this month’s subject being Gregg Mayles – a veteran game designer at Rare whose work includes Battletoads, Donkey Kong Country, Banjo-Kazooie, Viva Pinata and the current hot Xbox One game Sea Of Thieves. Of course, that’s not all – as always, plenty more games are featured in Retro Revivals, The Unconverted, Classic Moments, Lost In Translation and Back To The Noughties.", "You can find the magazine at all good newsagents from Thursday 22 April 2018, or order online via ", ". If you prefer a digital copy, you can find it via the ", ", ", ", ", ", ", " or ", ".", "01/ Lightforce – Marcel Donné", "\nOriginal composer: Rob Hubbard", "02/ The Last V8 – Fabian Del Priore & Marcel Donné", "\nOriginal composer: Rob Hubbard", "03/ Thalamusik: Sanxion Loading Theme – Matt Gray", "\nOriginal composer: Rob Hubbard", "04/ Ghouls ‘N Ghosts – Fastloaders", "\nOriginal composer: Tim Follin", "05/ Wizball 2000 (Lara And Enya Mix) – Tonka", "\nOriginal composer: Martin Galway", "06/ Flash Gordon – Chris Abbott & Alistair “Boz” Bowness", "\nOriginal composer: Rob Hubbard", "07/ Hyperion 2: Main Theme – Matt Gray", "\nOriginal composer: Matt Gray", "08/ Mega Apocalypse – Matt Gray", "\nOriginal composer: Rob Hubbard", "09/ Mutants – Reyn Ouwehand", "\nOriginal composer: Fred Gray", "10/ Phantoms Of The Asteroid – Matt Gray", "\nOriginal composer: Rob Hubbard", "11/ Galway Is God 2000 (CD Mix) – Jogeir Liljedahl", "\nOriginal composer: Martin Galway", "12/ Wizball (High Score) – Iridium feat. Kenz", "\nOriginal composer: Martin Galway", "Already interested, or bought the issue and liked what you heard? Head to ", " for more information on buying the full albums.", "Tags: ", ", ", ", ", ", ", ", ", ", ", ", "]},
{"title": "Twin Galaxies Disqualifies Billy Mitchell", "text": [" and banned him from entering new competitive scores, based on disputed Donkey Kong scores from 2010. The organisation opened with the following statement:", "“Based on the complete body of evidence presented in this official dispute thread, Twin Galaxies administrative staff has unanimously decided to remove all of Billy Mitchell’s scores as well as ban him from participating in our competitive leaderboards. We have notified Guinness World Records of our decision.”", "The 52 year old has been a famed competitive gamer for over 35 years, first achieving fame as part of the US National Videogame Team – a project put together by Twin Galaxies founder Walter Day. Later, he would gain acclaim as the first player to ever achieve a perfect game of Pac-Man, and first player to break one million points on Donkey Kong. However, it’s that last achievement which has been disputed, and ultimately caused Mitchell’s disqualification from Twin Galaxies.", "In February this year, Jeremy Young opened a dispute on Twin Galaxies regarding Billy Mitchell’s score of 1,047,200, submitted via video tape in 2010. This was one of the most famous high scores in competitive gaming – as well as being the first million point score on Donkey Kong, it was a score which regained Billy Mitchell the Donkey Kong world record. Famously, the submission of this tape was documented in The King Of Kong, a documentary film about the world record rivalry between Mitchell and Steve Wiebe. However, the taped footage for this score and two later scores allegedly contained graphical rendering quirks that were found in contemporary versions of MAME.", "The high score track Billy Mitchell was on specifically required players to submit scores obtained on real, unmodified arcade hardware. Following an investigation, Twin Galaxies concluded that although it could not prove that Mitchell had used MAME, it had gathered enough evidence (with the help of independent outside assessors) to believe that the footage cannot have come from real, unmodified Donkey Kong hardware. Accordingly, Mitchell’s scores across all games were struck from the record books, Mitchell was banned from further competition and Steve Wiebe is now recognised by Twin Galaxies as the first player to achieve one million points on Donkey Kong.", "During the course of this controversy, we have made attempts to reach out to Billy Mitchell for comment but received no response. In its own statement (", "), Twin Galaxies stated:", "“Twin Galaxies has endeavored to provide a fair opportunity and reasonable amount of time for all sides and interests to present their thoughts and evidence as it has evaluated this dispute claim.", "Twin Galaxies has also investigated this matter as comprehensively as reasonably possible to make sure that its findings are as informed as possible.", "Throughout every step of this investigation, Billy Mitchell had the opportunity to answer questions and contribute to the public dispute thread. However, he was under no obligation to participate in this dispute thread and as such he chose not to do so.”", "Rest assured, we will be examining this controversy and its fallout in greater depth in a future issue of the magazine.", "Tags: ", ", ", ", ", ", ", ", "]},
{"title": "Don’t miss this year’s PC Gaming Show", "text": ["If you love anything PC related you might be interested in visiting this year’s PC Gaming Show, our annual E3 showcase that highlights great new games and hardware which will be heading to PC.", "This year the show will be broadcasting via Facebook, YouTube, Twitch and Steam on Monday, June 11", " at 3PM Pacific, so make sure you don’t miss it. You can either get all your updates at ", "or you can catch all the best interviews, trailers and segments on ", ".", "As usual, Sean “Day[9]” Plott will be hosting, and if you happen to be near Los Angeles or will be visiting E3 then you can visit for absolutely free. This year’s show will be held at The Wiltern, so make sure you reserve your ticket now by visiting ", ".", "Tags: ", ", ", ", "]}
]